{
  "Classname": "func_detail",
  "Description": "Func_detail is useful brush entity, similar to [func_wall](../func_wall) except it doesn't support Render Modes. Detailed brushes like tables, signs, computers, pipes, cars e.t.c. should be turned into func_detail instead of func_wall. Brushes tied into func_detail are Detail Brushes. Detail brushes don't block vis, nor slowing vis processing down. It won't chop other brushes- it helps to avoid many compiling warnings. The one of most important feature of func_detail is that detail brushes won't count into models limit (just like func_walls) which is very easy to exceed in Sven Co-op. You can customize detail level (description below), and collision of func_brush (it's better than func_illusionary because of better lightning receiving and in-game decals support). Using this brush in replace of func_wall is highly recommended. Every keyvalue are optional, it's recommended to leave them as they are (with an except of \"Passable\" key) for beginner mappers.",
  "KeyDescriptions": [
    {
      "keyName": "zhlt_detaillevel",
      "keyDescription": "Detailed brushes with different detail level won't chop each other. Use higher amount for smaller details. Try to avoid too many detail levels in the map (it's increasing .bsp file size). E.g. func_detail table made of brushes have detail level of 1. On the table there are another func_details that represents computer screen, keyboard and mug. Those should have detail level value of 2 so they won't chop the faces of the table.",
      "keyChoices": []
    },
    {
      "keyName": "zhlt_chopdown",
      "keyDescription": "If you set this value to no less than a detail level, this brush can chop world brushes (if 'detail level' minus 'lower it's level to chop others' is equal to 0) and brushes from lower detail levels.",
      "keyChoices": []
    },
    {
      "keyName": "zhlt_chopup",
      "keyDescription": "Specify to chop brushes from higher detail levels than this func_detail.",
      "keyChoices": []
    },
    {
      "keyName": "zhlt_coplanarpriority",
      "keyDescription": "Prevents z-fighting. When two brushes have overlapping faces, this value controls which of those brushes faces have rendering priority. Note that both of those brushes must have same \"Detail Level\".",
      "keyChoices": []
    },
    {
      "keyName": "zhlt_clipnodedetaillevel",
      "keyDescription": "Should always be '0' or '1' unless you are grappling with cliphull errors.",
      "keyChoices": []
    },
    {
      "keyName": "zhlt_noclip",
      "keyDescription": "Specify whenever func_detail can be walked through ('Yes') or have full collision ('No'). Note that bullets will still hit this entity when it's passable.",
      "keyChoices": [
        {
          "choiceValue": "0 ",
          "choiceDescription": ""
        },
        {
          "choiceValue": "1 ",
          "choiceDescription": ""
        }
      ]
    }
  ],
  "Notes": [
    "Detail layers uses an advanced method to decide leafnode content, so they won't cause \"Ambiguous leafnode contents\" compile warning."
  ]
}