{
  "Classname": "game_text",
  "Description": "An entity to display HUD messages to the player who activated it, or all players.",
  "KeyDescriptions": [
    {
      "keyName": "spawnflags",
      "keyDescription": "SpawnflagsEmpty",
      "keyChoices": [
        {
          "choiceValue": "1",
          "choiceDescription": "If set, the game_text's message will be displayed to all players instead of just the activator."
        },
        {
          "choiceValue": "2",
          "choiceDescription": "If set, players will not receive a duplicate of the message in their console. Set this for messages that can be reread or are sent often to prevent console-spam and reduce network-bandwidth-usage."
        }
      ]
    },
    {
      "keyName": "message",
      "keyDescription": "The message to send. Can have a maximum of 490 chars. However, Valve Hammer Editor will truncate the string to 128 if longer than that and crash if the keyvalue is displayed while having more than 127 chars. If you need a message that long, it is advised to manually assemble it once using a few [trigger_changevalue](../trigger_changevalue) entities. Using '\\n', you can get into the next line.",
      "keyChoices": []
    },
    {
      "keyName": "x",
      "keyDescription": "Horizontal positioning. 0.0 to 1.0. 0.0 means left. 1.0 means right. More accurately, this defines the horizontal offset of where every line of the message starts. A value of 1.0 would literally shove the message off of the right side of the screen. '-1' centers every line depending on its length.",
      "keyChoices": []
    },
    {
      "keyName": "y",
      "keyDescription": "Vertical positioning. 0.0 to 1.0. 0.0 means top. 1.0 means bottom. '-1' centers the whole message as one, if it has multiple lines. It is advised to not center this, as it obscures the players view too much and looks shabby when drawn over the crosshair. Try values like 0.4 or 0.6 instead. Note that depending on the resolution, too high/low values may end up out of screen. Try to stay between 0.2 and 0.8. In case you ever wondered how big of an y-value equals exactly one line break, here is a list showing that in dependence on the player's resolution:\n1600 x 1200: 0.016666\n1280 x 960: 0.020800\n1280 x 1024: 0.019550\n1152 x 864: 0.023150\n1024 x 768: 0.026000\n800 x 600: 0.033333\n720 x 576: 0.034700\n640 x 480: 0.041600\n960 x 600: 0.033333\n1088 x 612: 0.032700\n1280 x 720: 0.027800\n1280 x 800: 0.025000\n1600 x 900: 0.022222",
      "keyChoices": []
    },
    {
      "keyName": "effect",
      "keyDescription": "Specify a text effect..",
      "keyChoices": [
        {
          "choiceValue": "0 ",
          "choiceDescription": "Has a time-value to fade in, to stay on screen and to fade out."
        },
        {
          "choiceValue": "1 ",
          "choiceDescription": "Same as 'Fade in/out', except that it causes the message to flicker."
        },
        {
          "choiceValue": "2 ",
          "choiceDescription": "Has a time-value for per-char color transition and fade-in time per char."
        }
      ]
    },
    {
      "keyName": "color",
      "keyDescription": "Color with which the text is rendered. Note that HUD messages are rendered additive. If you want your text to appear darker, make the color darker. You can add optional 4th parameter for opaque.",
      "keyChoices": []
    },
    {
      "keyName": "color2",
      "keyDescription": "Another color with which the text is rendered. It comes to use with 'Credits'- and 'Scan out'-effect only. Note that HUD messages are rendered additive. If you want your text to appear darker, make the color darker. You can add optional 4th parameter for opaque.",
      "keyChoices": []
    },
    {
      "keyName": "fadein",
      "keyDescription": "If the effect is 'Fade in/out' or 'Credits', this specifies the fade-in time. If the effect is set to 'Scan out', this sets the time that is taken for every single char to change its color from 'Color 2' to 'Color 1'. Fade-in time should be short.",
      "keyChoices": []
    },
    {
      "keyName": "fadeout",
      "keyDescription": "If the effect is 'Fade in/out' or 'Credits', this specifies the fade-out time. If the effect is set to 'Scan out', this has no effect. Fade-out time should be longer than fade-in time, so the player notices that the message is going to disappear and can react by trying to read faster.",
      "keyChoices": []
    },
    {
      "keyName": "holdtime",
      "keyDescription": "Time the message stays on screen after fading in, before it will being to fade out. For effect 'Scan out', this delay will start after all chars have faded in.",
      "keyChoices": []
    },
    {
      "keyName": "fxtime",
      "keyDescription": "For effect 'Scan out', this defines the time required for a character to fade in to 'Color 2'. The next char will only start fading in as the previous one finishes. Small values like 0.01 to 0.1 seconds make sense here.",
      "keyChoices": []
    },
    {
      "keyName": "channel",
      "keyDescription": "Select one of four channels to use. If a message already exists in one channel, it will be replaced.",
      "keyChoices": [
        {
          "choiceValue": "1 ",
          "choiceDescription": ""
        },
        {
          "choiceValue": "2 ",
          "choiceDescription": ""
        },
        {
          "choiceValue": "3 ",
          "choiceDescription": ""
        },
        {
          "choiceValue": "4 ",
          "choiceDescription": ""
        }
      ]
    },
    {
      "keyName": "master",
      "keyDescription": "Name of the [multisource](../multisource) entity that (temporary) locks this {{ entname }}. If master is specified the {{ entname }} will be disabled and it will not show text. When [multisource](../multisource) entity is triggered/being triggering by all possible inputs, the {{ entname }} will be unlocked. When [multisource](../multisource) lost at least one input signal, the entities becomes locked again.",
      "keyChoices": []
    },
    {
      "keyName": "target",
      "keyDescription": "Entity to trigger when text is displayed. Trigger use-type is 'Toggle'.",
      "keyChoices": []
    },
    {
      "keyName": "targetname",
      "keyDescription": "Set name of {{ entname }} so other entities can trigger it to display text. Every trigger use-type works uniformly. Firing on already displaying text resets it. Can be kill-targeted but already displayed text stays.",
      "keyChoices": []
    },
    {
      "keyName": "killtarget",
      "keyDescription": "Entity to remove when text is displayed."
    }
  ],
  "Notes": [
    "The game_text's target will be triggered when the game_text entity is triggered. This is very useful when you want to use a single notification sound consistently on all your game_text entities.",
    "Sven Co-op features a HUD monster-/player-info, which uses HUD message channel 3. Avoid using that channel for important messages. Even if you disable monster-info by setting the CVar 'mp_allowmonsterinfo' to '0', player-info will still display on that channel."
  ],
  "Issues": [
    "If a text message is replaced by another one because it is set to use the same channel, the time-values won't be updated, causing the new message to expire earlier than desired. Furthermore, only one text message can exist at a specific screen coordinate at a time, even if two different channels are provided.",
    "If one line of the message is too long to fit on a player's screen, it will crash the game."
  ]
}