{
  "Classname": "trigger_entity_iterator",
  "Description": "This entity allows you to simulate one or multiple entities triggering a specific other entity. For example, you can have all entities of classname \"player\" trigger a trigger_condition, or all entities with targetname \"zombie\" trigger a trigger_copyvalue. The triggered entity will receive every iterated entity as activator.",
  "KeyDescriptions": [
    {
      "keyName": "name_filter",
      "keyDescription": "Any entity/entities by the given name will be iterated, given they also are of the specific class set in \"Filter Entities by Classname\" (if set).",
      "keyChoices": []
    },
    {
      "keyName": "classname_filter",
      "keyDescription": "Any entity/entities by the given classname will be iterated, given they also match the name set in \"Filter Entities by Name\" (if set).",
      "keyChoices": []
    },
    {
      "keyName": "status_filter",
      "keyDescription": "Depending on what other option than \"No Filter (default)\" you set, additionally to the filtering by name and classname through the two above keyvalues, either only dead or only alive entities will be iterated over. (An entity is considered alive while the PEV \"deadflag\" is 0)",
      "keyChoices": [
        {
          "choiceValue": "0 ",
          "choiceDescription": ""
        },
        {
          "choiceValue": "1 ",
          "choiceDescription": ""
        },
        {
          "choiceValue": "2 ",
          "choiceDescription": ""
        }
      ]
    },
    {
      "keyName": "delay_between_triggers",
      "keyDescription": "Specify a delay, in seconds, between the individual iterations. E.g. when iterating over several zombies, this would be the delay between iterating every single zombie. A value of 0 disables this (default), causing all iteration-entities to be iterated in one go. A very low value like 0.00001 would mean to iterate over one entity every server frame.",
      "keyChoices": []
    },
    {
      "keyName": "targetname",
      "keyDescription": "Set name of {{ entname }} so other entities can trigger it to start iterating. Depending on trigger use-type: 'On'- start iterating or reset it if already running, 'Toggle'- start iterating or stop it if already running, 'Off'- stop iterating. Can be kill-targeted.",
      "keyChoices": []
    },
    {
      "keyName": "target",
      "keyDescription": "Name of the entity to be triggered by the individual iteration/activator-entities. It \"carries\" the iteration.",
      "keyChoices": []
    },
    {
      "keyName": "triggerstate",
      "keyDescription": "Set the use-type with which the iterated/activating entities will fire the iteration carrier-entity set by \"Trigger Target\".",
      "keyChoices": [
        {
          "choiceValue": "0 ",
          "choiceDescription": ""
        },
        {
          "choiceValue": "1 ",
          "choiceDescription": ""
        },
        {
          "choiceValue": "2 ",
          "choiceDescription": ""
        }
      ]
    },
    {
      "keyName": "run_mode",
      "keyDescription": "Set the mode of which targets are triggered.",
      "keyChoices": [
        {
          "choiceValue": "0 ",
          "choiceDescription": "Default, single-fire behaviour."
        },
        {
          "choiceValue": "1 ",
          "choiceDescription": "Every time you trigger this, a temporary copy will be created and perform one full run, then remove itself from the game. You can have multiple copies run simultaneously. This only makes sense with a non-zero \"Delay between Entities (secs)\"."
        },
        {
          "choiceValue": "2 ",
          "choiceDescription": "This entity becomes toggleable and will have a delay between complete iteration-passes of all iteration-entities, set by \"Delay before Restarting (secs)\"."
        }
      ]
    },
    {
      "keyName": "trigger_after_run",
      "keyDescription": "Entity to trigger after a full run has been completed/performed. Trigger use-type is 'Toggle'.",
      "keyChoices": []
    },
    {
      "keyName": "maximum_runs",
      "keyDescription": "Specify how many complete iteration-passes may be performed before this entity is removed from the game. Set this to 0 to disable this feature.",
      "keyChoices": []
    },
    {
      "keyName": "delay_between_runs",
      "keyDescription": "Specify a delay, in seconds, between complete iteration-passes. E.g. when iterating several zombies, this would be the delay between iterating all of those zombies and then iterating all of those zombies again. This is only relevant in constant mode and the individual interval will still be considered when this is used. A value of 0 will always cause a delay of a single server frame. The individual interval will not add onto this.",
      "keyChoices": []
    }
  ],
  "Notes": [
    "If \"Run Mode\" is set to 'Run Once' and if trigger_entity_iterator is triggered while currently running (delay between triggers greater than zero), it will stop and restart the iteration process immediately when triggered with use-type \"On\", but simply stop when triggered with any other use-type."
  ]
}