{
  "Classname": "trigger_random",
  "Description": "Entity that triggers randomly picked target from targets pool (may use random time delay). Can be set to trigger only target that haven't been triggered before by this trigger_random (when multiple triggering). Trigger use-type for all targets is 'Toggle'.",
  "KeyDescriptions": [
    {
      "keyName": "spawnflags",
      "keyDescription": "SpawnflagsEmpty",
      "keyChoices": [
        {
          "choiceValue": "1 ",
          "choiceDescription": "Makes trigger_random (with \"Timed\" flag) enabled at map start, so it will start it's timer and trigger random target on game start. If \"Trigger Once\" flag isn't selected, it will continue until deactivated by trigger."
        },
        {
          "choiceValue": "2 ",
          "choiceDescription": "When using random delays (\"Timed\" flag), this tells to trigger a random target once, instead of continuously triggering random targets until deactivation (in that case, disable timer by triggering this entity again)."
        },
        {
          "choiceValue": "4 ",
          "choiceDescription": "If set, the trigger_random with \"Unique\" flag can be used again after having fired its targets, handling all of them as if not triggered before again."
        },
        {
          "choiceValue": "8 ",
          "choiceDescription": "Enables \"Minimum delay\" and \"Maximum delay\" keyvalues so you can specify to wait a random amount of time before triggering random targets. When \"Trigger Once\" and \"Start On\" flags are NOT selected, triggering this trigger_random starts the timer, and it will fire it's targets with random delays repeatedly until triggered again, what pauses it."
        },
        {
          "choiceValue": "16 ",
          "choiceDescription": "Trigger will pick target (each time it's triggered), that haven't been triggered yet, randomly. So if four targets are specified, the combination in which they can be picked may be: 3th, 1th, 2th, 4th. It never repeats the same target unless \"Reusable\" flag is selected- the list will be \"shuffled\", and targets can be picked all over again."
        }
      ]
    },
    {
      "keyName": "targetname",
      "keyDescription": "Set name of {{ entname }} so other entities can trigger it to pick random target (or toggle constant picking with \"Timed\" flag enabled). Every trigger use-type works uniformly. Can be kill-targeted.",
      "keyChoices": []
    },
    {
      "keyName": "min_delay",
      "keyDescription": "Requires \"Timed\" flag. Minimum delay, in seconds, till a random target will be fired. Set it to 0 to disable minimum value.",
      "keyChoices": []
    },
    {
      "keyName": "max_delay",
      "keyDescription": "Requires \"Timed\" flag. Maximum delay, in seconds, till a random target will be fired. Set it to 0 to disable maximum value.",
      "keyChoices": []
    }
  ]
}